doc/history.org
#+TITLE: DvorakJ 更新履歴
#+AUTHOR: blechmusik
#+EMAIL: blechmusik@gmail.com
#+LANGUAGE: ja
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./bootstrap3/css/bootstrap.min.css">
#+HTML_HEAD: <script type="text/javascript" src="./js/jquery-latest.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="./bootstrap3/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="./js/dvorakj-doc.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="./js/generate_TOC.js"></script>
#+OPTIONS: toc:nil num:nil author:nil creator:nil html-style:nil timestamp:nil

# org-mode: 「アンダースコアで下付き」を無効にする - ライ麦畑で、つか、前見て
# http://d.hatena.ne.jp/sonota88/20111204/1322974507
#+OPTIONS: ^:{}

# ----------------------------------------------------------------------

# write current dvorakj version to ini file.
# then, export this readme.org to html and text (utf-8)
# (progn (write-dvorakj-version "../data/version.ini") (org-export-as-html-and-ascii-with-bom))

# ----------------------------------------------------------------------


* 最近の更新履歴

** 2014-06-07

*** 不具合の修正

	- 「単一キー」の設定により、無変換キーと変換キーで何かしらのキーを発行すると、そのキーを二度発行してしまう症状に対処しました

** 2014-06-02
*** 機能の追加

    - 設定画面の「起動時の設定」から、スタートアップにショートカットのリンクを作成できるようにしました

*** 仕様の変更

    - Microsoft が Windows XP のサポートを打ち切ったことを受けて、動作確認済みの OS として Windows Vista 以後の OS を掲げるようにしました
    - Growl との連携機能を取り除きました
    - 設定画面の「その他」の項目の名称を変更しました
    - スタートアップにショートカットのリンクを作成する機能を、「ツール」から取り除きました
    - 再起動を要する設定変更については、トレイチップにメッセージを表示するようにしました

*** その他

    - AutoHotkey <1.1.15.00 - May 4, 2014> を導入しました

** 2014-03-30
*** 仕様の変更

	- ユーザーがGoogle 日本語入力使用中であることを明示的に設定した場合、シフトキーを用いる動作にそうした設定が反映されない不具合を修正しました[fn:14]

*** その他
	- 不要な条件分岐の処理をいくつか取り除きました

** 2014-03-29
*** 仕様の変更

	- Windows 8.1 で Google 日本語入力の入力モードを取得できない場合があるので、 ユーザーがGoogle 日本語入力使用中であることを明示的に設定できるようにしました[fn:13]

** 2014-03-21
*** 仕様の変更

	- 直接入力用配列の一時使用のための設定項目を、「直接入力」の箇所に移しました
    - 設定項目を表示する領域を若干拡張しました
    - 設定項目中の表現をいくつか変更しました
    - スクリプト版を利用している場合には、デバッグ用のメニューの表示・非表示を選択できるようにしました（その他->画面）
   
*** その他

    - 黒塗り下駄配列の設定ファイルを更新しました
    - Dvorak配列（黒塗り下駄配列との融合版）の設定ファイルを更新しました

** 2014-03-09
*** 不具合の修正

	- [[http://mkweb.bcgsc.ca/carpalx/?full_optimization][QGMLWY]] の設定が一部 qwerty 配列の設定になっていましたので修正しました[fn:12]


** 2014-02-09
*** 機能の追加

	- DvorakJ のスタートアップへの登録を外部プログラムから実行できるようにしました (app/Dvorakj_create_and_delete_shortcut)
	- DvorakJ の動作を外部プログラムから再開できるようにしました (app/Dvorakj_resume)
	- DvorakJ の動作を外部プログラムから終了できるようにしました (app/Dvorakj_exit)
	- DvorakJ の動作を外部プログラムから再起動できるようにしました (app/Dvorakj_reload)

*** 仕様の変更

    - メニュー内部のアイコンをいくつか変更しました

** 2014-01-29
*** 機能の追加

	- DvorakJ の動作を外部プログラムから停止できるようにしました (app/Dvorakj_suspend)

** 2013-11-24
*** 不具合の修正

	- パス名に関する不要な処理を取り除きました
	- 起動時に指定したアプリケーションを実行する設定画面に相対パスが適切に表示されなくなる症状に対処しました

** 2013-11-20
*** 仕様の変更

	- ファイルやフォルダを開く際にそのパスが存在しないならば、日本語でエラーメッセージを表示するようにしました


** 2013-11-16
*** 機能の追加

	- DvorakJの起動時に指定したアプリケーションを実行できるようにしました

*** その他
	- Autohotkey ファイルパス関数群を利用するようにしました [fn:11]
	- [[http://l.autohotkey.net/][AutoHotkey_L]] <October 11, 2013 - v1.1.13.01> を導入しました

** 2013-10-26

*** 不具合の修正

	- 変換候補窓の出現時に直接入力を一時的に使用する設定で、予想入力（推測変換）の表示窓を変換候補窓として誤検出しないようにしました


*** 仕様の変更

	- 「IME関連」カテゴリの項目の文言をいくつか変更しました

** 2013-10-25

*** 不具合の修正

	- 単一キーの設定によっては、同時に打鍵する配列で無変換キーや変換キーが使用できなくなる不具合を修正しました[fn:10]

*** 仕様の変更

	- 更新情報を取得する処理でメッセージの一部をメニュー・トレイに表示するようにしました
	- 「間隔」カテゴリを「待機・遅延」カテゴリに名称を変更しました
	- 「IME関連」カテゴリでIMEの状態を検出する間隔を設定するようにしました
	- 設定画面の項目の配置をいくつか変更しました
	- 設定画面上の文言をいくつか変更しました

*** その他

	- Windows 8.1 の環境下で DvorakJ を開発するようにしました


** 2013-10-23

*** 不具合の修正

	- 変換候補窓の出現時に直接入力を一時的に使用する機能を利用できるように修正しました [fn:9]

*** 仕様の変更

	- 単一キーの機能選択画面で、セパレーターを表示するようにしました

** 2013-09-28
   
*** 機能の追加

	- 垂直スクロールの方向を逆にできるようにしました[fn:8]。くるくるスクロールにも対応しています。

*** 仕様の変更

	- 「中国語入力時」に「直接入力を一時的に使用する」設定で、[[http://cpime.hk/][広東語ピンイン入力ソフト CPIME]] に対応しました[fn:7]。

** 2013-09-18

*** 不具合の修正

	- スクリプト版のソースコードとして # から始まるファイル名のスクリプトを収録するようにしました[fn:6]
	- 実行バイナリ版において中国語入力中か否かを判定できない問題に対処しました[fn:5]

*** 仕様の変更

	- DvorakJ_Updater による最新版の導入処理時に、動作を少々遅らせることによって挙動の安定化を図るようにしました
	- 直接入力の設定を中国語入力時に利用するよう設定している場合に限り、[[http://msdn.microsoft.com/ja-jp/library/cc364671.aspx][GetKeyboardLayout 関数]]を用いて入力ロケール識別子を取得するようにしました

** 2013-09-17

*** 仕様の変更

	- 中国語入力時に直接入力用配列の使用するかどうかを「IME関連」で明示的に設定するようにしました[fn:2]
    
*** その他

	- DvorakJ本体と設定ウィンドウ間の連携に用いていたファイルを一切作成しないようにしました

** 2013-09-16

*** 機能の追加

	- スタートアップに登録している DvorakJ のリンクをメニューバーから削除できるようにしました


*** 不具合の修正

	- 更新処理の際ウィンドウ内の文字が化けてしまう現象に対処しました
	- キーボード配列を解析するスクリプト版のプログラムが動作しなくなっていた問題を解消しました

*** 仕様の変更
    
	- README.txt と history.txt を BOM付きの utf-8 で保存するようにしました
	- スクリプト版を使用しているときでもプログラムの更新を確認できるようにしました


** 2013-09-15

   
*** 機能の追加
	- [[http://www.growlforwindows.com/gfw/][Growl for Windows]] を使って各種通知を表示できるようにしました
	- 通知を頻繁に行うかどうかを選択できるようにしました
	- マウスホイールの方向を逆にできるようにしました[fn:4]

*** 仕様の変更
- ツールチップを用いて各種通知を表示するようにしました
- DvorakJ の動作停止中にはキーボード配列名に打ち消し線を挿入するようにしました

*** 機能の改良
- DvorakJ本体と設定ウィンドウ間の連携を即座に処理するようにしました[fn:3]

*** その他
- [[http://l.autohotkey.net/][AutoHotkey_L]] <1.1.13.00 - August 27, 2013> を導入しました
- IME.ahk の最新版（【 更新日 】 2012.11.10 ）を導入しました[fn:1]
- [[http://orgmode.org/][org-mode]] を使ってドキュメント類を作成するようにしました


* 過去の更新履歴


[[http://blechmusik.xii.jp/dvorakj/][DvorakJのページ]] 中の"全般:更新履歴"を参照してください。

* Footnotes

[fn:1] [[http://www6.atwiki.jp/eamat/pages/17.html][eamat @Cabinet - IME制御]] の  [[http://www6.atwiki.jp/eamat/pages/18.html][eamat @Cabinet - IME.ahk]]

[fn:2] 従来は「全角英数または半角英数入力時」に直接入力を一時的に使用するよう設定すれば、中国語入力時にも直接入力用の配列を使用していました。

[fn:3] iniファイルでのやりとりを止めて[[http://l.autohotkey.net/docs/commands/PostMessage.htm][PostMessage / SendMessage]]を活用するようにしました。

[fn:4] https://twitter.com/h084/status/120840316055064576 への対応です

[fn:5] [[http://blechmusik.hatenablog.jp/entry/2013/09/16/021205#comment-11696248318757832174][konzertnr9 さんのご指摘]]に対応したものです。入力ロケール識別子を取得する[[http://msdn.microsoft.com/ja-jp/library/cc364671.aspx][GetKeyboardLayout 関数]]の呼び出しが実行バイナリ版では失敗していたため、キーボードの情報を正しく取得できていませんでした。

[fn:6] [[http://blechmusik.hatenablog.jp/entry/2013/09/17/012643#comment-11696248318757858094][kasuga_toru さんのご指摘]]に対応したものです。

[fn:7] 三好さんのご指摘（メール）に対応したものです。

[fn:8] [[https://twitter.com/h084/status/120840316055064576][丸橋裕生 さんのご指摘]]に対応したものです。

[fn:9] [[http://blechmusik.hatenablog.jp/entry/2013/10/19/212857#comment-12921228815711173186][noporuさんのご指摘]] に対応したものです。

[fn:10] [[http://blechmusik.hatenablog.jp/entry/2013/09/16/021205][お魚さんのご指摘]] と [[https://twitter.com/sakazuki/status/393304552780210176][sakazukiさんのご指摘]] に対応したものです。

[fn:11] [[http://www6.atwiki.jp/eamat/pages/22.html][eamat @Cabinet - Path.txt]]

[fn:12] [[https://twitter.com/fsktakahasi/status/442631526073630721][fsktakahasiさんのご指摘]] に対応したものです。

[fn:13] 鮎月さんのご指摘（メール）に対応したものです。

[fn:14] 鮎月さんのご指摘（メール）に対応したものです。


